balazsgrill/modembed/res/Devices/dsPIC30/PIC24F08KL302.PIC
        <edc:SFRDef edc:access="-nn-n--nnnn----n" edc:cname="CNPD2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00-0--0000----0" edc:name="CNPD2" edc:nzwidth="16" edc:por="-00-0--0000----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PDE" edc:desc="" edc:mask="0x1" edc:name="CN16PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN21PDE" edc:desc="" edc:mask="0x1" edc:name="CN21PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN22PDE" edc:desc="" edc:mask="0x1" edc:name="CN22PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN23PDE" edc:desc="" edc:mask="0x1" edc:name="CN23PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN24PDE" edc:desc="" edc:mask="0x1" edc:name="CN24PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN27PDE" edc:desc="" edc:mask="0x1" edc:name="CN27PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN29PDE" edc:desc="" edc:mask="0x1" edc:name="CN29PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN30PDE" edc:desc="" edc:mask="0x1" edc:name="CN30PDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnn-nnnnnnnnnn" edc:cname="CNEN1" edc:desc="Change Notice Enable - Register 1 (of 2)" edc:impl="0xfbff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0000000000" edc:name="CNEN1" edc:nzwidth="0x10" edc:por="00000-0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0IE" edc:desc="Interrupt Enable for Change Notice 0" edc:mask="0x1" edc:name="CN0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1IE" edc:desc="Interrupt Enable for Change Notice 1" edc:mask="0x1" edc:name="CN1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2IE" edc:desc="Interrupt Enable for Change Notice 2" edc:mask="0x1" edc:name="CN2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3IE" edc:desc="Interrupt Enable for Change Notice 3" edc:mask="0x1" edc:name="CN3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4IE" edc:desc="Interrupt Enable for Change Notice 4" edc:mask="0x1" edc:name="CN4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5IE" edc:desc="Interrupt Enable for Change Notice 5" edc:mask="0x1" edc:name="CN5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6IE" edc:desc="Interrupt Enable for Change Notice 6" edc:mask="0x1" edc:name="CN6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7IE" edc:desc="Interrupt Enable for Change Notice 7" edc:mask="0x1" edc:name="CN7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8IE" edc:desc="" edc:mask="0x1" edc:name="CN8IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN9IE" edc:desc="Interrupt Enable for Change Notice 9" edc:mask="0x1" edc:name="CN9IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN11IE" edc:desc="Interrupt Enable for Change Notice 11" edc:mask="0x1" edc:name="CN11IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12IE" edc:desc="Interrupt Enable for Change Notice 12" edc:mask="0x1" edc:name="CN12IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13IE" edc:desc="Interrupt Enable for Change Notice 13" edc:mask="0x1" edc:name="CN13IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14IE" edc:desc="Interrupt Enable for Change Notice 14" edc:mask="0x1" edc:name="CN14IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15IE" edc:desc="Interrupt Enable for Change Notice 15" edc:mask="0x1" edc:name="CN15IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn-n--nnnn----n" edc:cname="CNEN2" edc:desc="Change Notice Enable - Register 2 (of 2)" edc:impl="0x69e1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00-0--0000----0" edc:name="CNEN2" edc:nzwidth="0x10" edc:por="-00-0--0000----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16IE" edc:desc="" edc:mask="0x1" edc:name="CN16IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN21IE" edc:desc="" edc:mask="0x1" edc:name="CN21IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22IE" edc:desc="" edc:mask="0x1" edc:name="CN22IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23IE" edc:desc="" edc:mask="0x1" edc:name="CN23IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24IE" edc:desc="" edc:mask="0x1" edc:name="CN24IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN27IE" edc:desc="" edc:mask="0x1" edc:name="CN27IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN29IE" edc:desc="" edc:mask="0x1" edc:name="CN29IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30IE" edc:desc="" edc:mask="0x1" edc:name="CN30IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnn-nnnnnnnnnn" edc:cname="CNPU1" edc:desc="" edc:impl="0xfbff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0000000000" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="00000-0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PUE" edc:desc="" edc:mask="0x1" edc:name="CN0PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1PUE" edc:desc="" edc:mask="0x1" edc:name="CN1PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PUE" edc:desc="" edc:mask="0x1" edc:name="CN8PUE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN9PUE" edc:desc="" edc:mask="0x1" edc:name="CN9PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN11PUE" edc:desc="" edc:mask="0x1" edc:name="CN11PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PUE" edc:desc="" edc:mask="0x1" edc:name="CN12PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PUE" edc:desc="" edc:mask="0x1" edc:name="CN13PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PUE" edc:desc="" edc:mask="0x1" edc:name="CN14PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PUE" edc:desc="" edc:mask="0x1" edc:name="CN15PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn-n--nnnn----n" edc:cname="CNPU2" edc:desc="" edc:impl="0x69e1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00-0--0000----0" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="-00-0--0000----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN21PUE" edc:desc="" edc:mask="0x1" edc:name="CN21PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PUE" edc:desc="" edc:mask="0x1" edc:name="CN24PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN27PUE" edc:desc="" edc:mask="0x1" edc:name="CN27PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN29PUE" edc:desc="" edc:mask="0x1" edc:name="CN29PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PUE" edc:desc="" edc:mask="0x1" edc:name="CN30PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="n----------nnnn-" edc:cname="INTCON1" edc:desc="" edc:impl="0x805e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------0000-" edc:name="INTCON1" edc:nzwidth="0x10" edc:por="0----------0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCFAIL" edc:desc="" edc:mask="0x1" edc:name="OSCFAIL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKERR" edc:desc="" edc:mask="0x1" edc:name="STKERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDRERR" edc:desc="" edc:mask="0x1" edc:name="ADDRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MATHERR" edc:desc="" edc:mask="0x1" edc:name="MATHERR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NSTDIS" edc:desc="" edc:mask="0x1" edc:name="NSTDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-----------nnn" edc:cname="INTCON2" edc:desc="" edc:impl="0xc007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----------000" edc:name="INTCON2" edc:nzwidth="0x10" edc:por="00-----------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="11"/>
              <edc:SFRFieldDef edc:cname="DISI" edc:desc="" edc:mask="0x1" edc:name="DISI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALTIVT" edc:desc="" edc:mask="0x1" edc:name="ALTIVT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
